Revit 2027 API
DuctSettings.GetPressLossCalculationServerInfo Method
 Get the MEPServerInfo of the current pipe pressure loss calculation server.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public MEPCalculationServerInfo GetPressLossCalculationServerInfo()
Public Function GetPressLossCalculationServerInfo As MEPCalculationServerInfo
public:
MEPCalculationServerInfo^ GetPressLossCalculationServerInfo()
member GetPressLossCalculationServerInfo : unit -> MEPCalculationServerInfo
Return Value
MEPCalculationServerInfo
 The MEPServerInfo of the current pipe pressure loss calculation server
See Also
Reference
DuctSettings Class
Autodesk.Revit.DB.Mechanical Namespace